# ============================================================
# data-dev-tools Brewfile
# Run: brew bundle --file=Brewfile
# ============================================================

# ------------------------------------------------------------
# Taps
# ------------------------------------------------------------
tap "databricks/tap"
tap "dbt-labs/dbt-cli"

# ------------------------------------------------------------
# CLI Tools - Cloud Platforms
# ------------------------------------------------------------
brew "snowflake-cli"                # Snowflake CLI (snow)
brew "databricks/tap/databricks"    # Databricks CLI
brew "azure-cli"                    # Azure CLI (az)
brew "awscli"                       # AWS CLI (aws)

# ------------------------------------------------------------
# CLI Tools - Data
# ------------------------------------------------------------
brew "duckdb"                       # DuckDB CLI

# ------------------------------------------------------------
# CLI Tools - Terminal & Productivity
# ------------------------------------------------------------
brew "tmux"                         # Terminal multiplexer
brew "lazygit"                      # Git TUI
brew "atuin"                        # Shell history search
brew "zoxide"                       # Smarter cd
brew "mactop"                       # macOS system monitor
brew "llmfit"                       # Find models for your hardware

# ------------------------------------------------------------
# Desktop Applications
# ------------------------------------------------------------
cask "ghostty"                      # Terminal emulator
cask "cmux"                         # Ghostty-based terminal app
cask "visual-studio-code"           # VS Code
cask "dbeaver-community"            # DBeaver database tool
cask "sublime-text"                 # Sublime Text
cask "lm-studio"                    # LM Studio
cask "logitech-g-hub"              # Logitech G Hub
cask "claude"                       # Claude Desktop

# ------------------------------------------------------------
# Mac App Store (requires `mas` CLI)
# ------------------------------------------------------------
brew "mas"                          # Mac App Store CLI
mas "Amphetamine", id: 937984704    # Keep-awake utility
