# ============================================================
# data-dev-tools Brewfile
# Run: brew bundle --file=Brewfile
# ============================================================

# ------------------------------------------------------------
# Taps
# ------------------------------------------------------------
tap "databricks/tap"
tap "dbt-labs/dbt-cli"

# ------------------------------------------------------------
# CLI Tools - Cloud Platforms
# ------------------------------------------------------------
brew "snowflake-cli"                # Snowflake CLI (snow)
brew "databricks/tap/databricks"    # Databricks CLI
brew "azure-cli"                    # Azure CLI (az)
brew "awscli"                       # AWS CLI (aws)
brew "terraform"                    # Infrastructure as code

# ------------------------------------------------------------
# CLI Tools - Data
# ------------------------------------------------------------
brew "duckdb"                       # DuckDB CLI
brew "jq"                           # JSON processor
brew "yq"                           # YAML processor
brew "parquet-tools"                # Inspect Parquet files
brew "pgcli"                        # Postgres CLI with autocomplete
brew "rclone"                       # Sync files to/from cloud storage

# ------------------------------------------------------------
# CLI Tools - Terminal & Productivity
# ------------------------------------------------------------
brew "gh"                           # GitHub CLI
brew "lazygit"                      # Git TUI
brew "eza"                          # Modern ls with git integration
brew "starship"                     # Customizable shell prompt
brew "atuin"                        # Shell history search
brew "zoxide"                       # Smarter cd
brew "mactop"                       # macOS system monitor
brew "pipx"                         # Install Python CLI tools in isolation
brew "yarn"                         # JavaScript package manager
brew "nvm"                          # Node.js version manager
brew "llmfit"                       # Find models for your hardware

# ------------------------------------------------------------
# Desktop Applications
# ------------------------------------------------------------
cask "docker"                        # Docker Desktop
cask "anaconda"                      # Python 3 + data science packages
cask "ghostty"                      # Terminal emulator
cask "cmux"                         # Ghostty-based terminal app
cask "visual-studio-code"           # VS Code
cask "dbeaver-community"            # DBeaver database tool
cask "sublime-text"                 # Sublime Text
cask "lm-studio"                    # LM Studio
cask "microsoft-azure-storage-explorer"  # Azure Storage Explorer
cask "tad"                          # Parquet/CSV/SQLite viewer
cask "json-crack"                   # Visual JSON viewer
cask "qlstephen"                    # Quicklook plugin for plain text files
cask "quicklook-json"               # Quicklook plugin for JSON files
cask "slack"                        # Slack messaging
cask "microsoft-teams"              # Microsoft Teams
cask "logitech-g-hub"              # Logitech G Hub
cask "claude"                       # Claude Desktop

# ------------------------------------------------------------
# Mac App Store (requires `mas` CLI)
# ------------------------------------------------------------
brew "mas"                          # Mac App Store CLI
mas "Amphetamine", id: 937984704    # Keep-awake utility
mas "WhatsApp Messenger", id: 310633997  # WhatsApp messaging
